/* 변수 : 알파벳 
 * 연산자 : 단어
 * 제어문 : 단어 --> 문장
 * 메소드 : 독해
 * 클래스 : 회화 
 * 데이터 처리 
 * 
 * 	연산자 
 * 	====
 *	1. 단항 연산자
 *	 1) 증감연산자 (++,--) : 1증가, 1감소
 *		ex) int a=10;
 * 		 	int b=a++; //b에 a를 집어넣은 후 a를 1증가시킴  
 * 	 		int c=++a; //a를 1증가시킨 후 c에 집어넣음
 * 	 2) 부정연산자 (!)
 * 		- 조건문 (if,while,for)에 쓰임. 결과값은 boolean임 (true/false)
 * 	 3) 타입연산자 (데이터형) 
 * 		- 형 변환에 사용되는 연산자. 
 * 		ex) (int)10.5 --> 10
 * 			(char)65 --> 'A'
 * 	2. 이항연산자
 *	 1) 산술연산자 (+,-,*,/,%)
 *		/ (0으로 나눌 수 없으며, 정수/정수=정수 임에 유의)
 *		% (나머지 부호는 맨 왼쪽항의 부호를 따른다는 것에 유의. ex) -5%-2=-1, -5%2=-1)
 *	 2) 비교연산자 (==,!=,<,>,<=,>=)
 * 		- 결과값은 boolean임. (true, false). (비교한 결과니까... )
 *   3) 논리연산자 (&&, ||) 
 *    	- 조건 두 개 연산처리. 결과값은 boolean(true or false)
 *    	- 효율적인 연산 ★
 *    		(1) 조건1(True)||조건2 : 조건2는 연산 안 함.★★ 조건2가 뭐든 결과값이 무조건 True니까. 
 *    		(2) 조건1(False)&&조건2 : 조건2는 연산 안 함.★★ 조건2가 뭐든 결과값이 무조건 False니까.
 * 	 4) 대입연산자
 * 		(1) =
 * 		(2) 복합 대입연산자 (+=,-=)
 * 		 - a+=2; <--> a=a+2;
 * 		 - a-=2; <--> a=a-2;
 * 	3. 삼항연산자 (조건?값1:값2)
 * 		- 형식 : 조건?값1:값2 <-- 조건이 true면 값1 출력, false면 값2 출력. 
 * 
*/
public class 일주차정리3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}






